// Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа.

Console.Write("Введите натуральное число, обозначающее количество слов, которые Вы введёте: ");
int n = Convert.ToInt32(Console.ReadLine());
